Tekla.Structures.Drawing.AngleTypes
The different types for angle dimensions.

Tekla.Structures.Drawing.AngleTypes.AngleOnSide
Shows the angle dimensions in degrees on the side.

Tekla.Structures.Drawing.AngleTypes.AngleAtVertex
Shows the angle dimensions in degrees at the angle vertex.

Tekla.Structures.Drawing.AngleTypes.Triangle
Shows the angle dimensions using a triangle. The triangle base length can be configured.

Tekla.Structures.Drawing.AngleTypes.TriangleWithDegrees
Shows the angle using a triangle, also shows the angle in degrees on one side of the triangle.

Tekla.Structures.Drawing.AngleTypes.AngleOnSideGradian
Shows the angle dimensions in gradians on the side.

Tekla.Structures.Drawing.AngleTypes.AngleAtVertexGradian
Shows the angle dimensions in gradians at the angle vertex.

Tekla.Structures.Drawing.AngleTypes.TriangleWithGradians
Shows the angle using a triangle, also shows the angle in gradians on one side of the triangle.